#ifndef HOMEWORK_9_H_INCLUDED
#define HOMEWORK_9_H_INCLUDED

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "help_functions.h"

//Напишете C програма за намиране на дължината на низ с помощта на цикъл, без да
//използвате вградена библиотечна функция strlen() 
void Zadacha_1(void);
//Напишете C програма за свързване на два низа в един низ, без да използвате библиотечна
//функция strcat()
void Zadacha_2(void);
//Напишете C програма за сравняване на два низа, използвайки цикъл символ по символ, без
//да използвате вградена библиотечна функция strcmp()
void Zadacha_3(void);
//Напишете програма на C, за да проверите дали даден низ е палиндром или не, без да
//използвате цикъл
void Zadacha_4(void);
//Напишете C програма за намиране на символа с най-висока честота в низ с помощта на
//цикъл	
void Zadacha_5(void);
//Напишете C програма за премахване на всички повтарящи се символи в низ с помощта на
//цикли
void Zadacha_6(void);
//Напишете C програма за отрязване както на водещите, така и на крайните символи за
//празно пространство в низ с помощта на цикъл
void Zadacha_7(void);
//Напишете C програма за премахване на допълнителните интервали и празни места от низ.
void Zadacha_8(void);
//Напишете C програма за броене на срещания на дума в даден низ с помощта на цикъл
void Zadacha_9(void);
//Напишете C програма за премахване на всички срещания на дадена дума в низ с помощта
//на цикъл
void Zadacha_10(void);
void WelcomeFunction(void);

#endif // HOMEWORK_9_H_INCLUDED