#ifndef HOMEWORK_13
#define HOMEWORK_13
//Напишете функция, с която да разделите даден едносвързан свързан списък от цели числа, в
//два списъка по следния начин.
//Ако първоначалният списък е L = (l0, l1, ....., ln), то
//новополучените списъци мжгот до са R1 = (l0, l2, l4, .....) и R2 = (l1, l3, l5, .....)
void Zadacha_1(void);
//Напишете функция, с която да вмъкнете възел „t“ преди възел, посочен с „X“ в
//единичен свързан списък „L“
void Zadacha_2(void);
//Напишете функция, с която да да изтриете възел, посочен с „p“ от едносвързан списък „L“
void Zadacha_3(void);
//Да предположим, че подреден списък L = (l0, l1, .....,ln) е представен от единичен свързан
//списък. Добавете списъка L = (ln, l0, l1, ....., ln) след друг подреден списък M, представен от
//единично свързан списък
void Zadacha_4(void);
//Използвайте динамична реализация на стек за въвеждане на поредица от цели положителни
//числа и нейното извеждане върху екрана в обратен ред. За край на поредицата от
//клавиатурата се въвежда 0
void Zadacha_5(void);
//Дадени с два стека с числа и числата в тях са сортирани във низходящ
//ред отдолу нагоре.Да се напише програма на C, която слива двата стека в
//сортиран масив
void Zadacha_6(void);
//В стек са записани няколко думи, чийто брой не е известен. Да се напише
//програма, която прочита дума, въведена от клавиатурата и проверавя дали
//тази дума е записана в стека
void Zadacha_7(void);
//Даден е стек от произволни реални числа. Да се напише програма, която
//изтрива от този стек всички отрицателни числа
void Zadacha_8(void);
//Като използвате стек, напишете програма, която проверява
//дали в едни аритметичен израз, записан чрез стринг, на всяка
//отваряща скоба отговаря затваряща. Проверете за трите вида
//скоби ( ), [ ], { }
void Zadacha_9(void);
//Като използвате опашка, отпечатайте първите n числа на
//Фибоначи.
//Напомняне F_0=1, F_1=1, F_2=F_0+F_1=2
//или всяка следващо е сбора на предишните две числа
void Zadacha_10(void);
//Напишете програма, която въвежда едно голямо цяло число,
//записано в масив и като използвате стек и опашка запишете
//това число в обратен ред, четено отзад напред
void Zadacha_11(void);
//Като използвате стек, напишете програма, която прочита едно
//цяло положително число и преобразува това число в двоична
//бройна система, т.е. записва го в двоичен вид.
void Zadacha_12(void);
void WelcomeFunction(void);

#endif